src/Catalogs/Actions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Actions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IsInternal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InternalDataProcessor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Actions/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.PathToInternaldataProcessor.Visible = Object.IsInternal;
	Items.DataProcessor.Visible = not Object.IsInternal;
	
EndProcedure

&AtClient
Procedure IsInternalOnChange(Item)
	
	Items.PathToInternaldataProcessor.Visible = Object.IsInternal;
	Items.DataProcessor.Visible = not Object.IsInternal;

EndProcedure
 
&AtClient 
//
//
Procedure ItemChoose(Item, Params) Export 
	If Item <> Undefined Then
		Object.InternaldataProcessor = Item.Value;	
	EndIf; 	
EndProcedure
 
&AtClient
Procedure PathToInternaldataProcessorStartChoice(Item, ChoiceData, StandardProcessing)
 	
	List = RepositoryTasks.GetInternalDataProcessors();
	ND = new NotifyDescription("ItemChoose",ThisObject);
	List.ShowChooseItem(ND);
		
EndProcedure
